const data = {
    courses : [
        {
            id: 1,
            teacherId: 2,
            image: 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcShJ0T7AUZ494y4hG5UZTMqBXfkZU2WGexunA&usqp=CAU',
            posterVideo : 'https://botostart.org/images/posters/typescript.png',
            videoSrc: 'https://botostart.org/courses/other/typescript/videos/typescript-00-what-is-typescript.mp4',
            name: 'typescript',
            title: 'دوره مقدماتی تا پیشرفته تایپ اسکریپت',
            horse: 25,
            student: 162,
            price: 1589000,
            numberSessions : 39,
            controversialQuestions : [
                {
                    id: 1,
                    title: 'پیشنیاز دارد؟',
                    text: 'بله، برای شروع این دوره باید جاوااسکریپت را در سطح متوسط بلد باشید..'
                },
                {
                    id: 2,
                    title: 'در حین دیدن دوره به مشکل خوردم چیکار کنم؟ پشتیبانی دارد؟',
                    text: 'صددرصد، دوره پشتیبانی دایمی دارد. یعنی چه در حین آموزش یا مصاحبه های استخدامی و حتی بعد از استخدام و پروژه گرفتن نیز میتوانید تمام سوال هایتان را بپرسید.'
                },
                {
                    id: 3,
                    title: 'دوره پروژه محور است؟',
                    text: 'به نظر من یک آموزش زمانی منجر به یادگیری و تسلط میشود که با پروژه همراه باشد به همین دلیل هم چندین پروژه مهم و کاربردی داخل دوره کار شده'
                },
                {
                    id: 4,
                    title: 'دوره آپدیت است؟',
                    text: 'بله، دوره کاملا آپدیت است و همچنین مباحثی که مورد نیاز دانشجو ها باشد و یا استفاده ازشون در پروژه ها رو به افزایش باشد نیز به دوره اضافه خواهد شد'
                },
            ],
            questions: [
                {
                    id: 1,
                    title: 'زبان برنامه نویسی TypeScript چیست؟ ',
                    text: 'با استفاده از TypeScript می توان کدها را به روش ساده تری نوشت و با کامپایل کردن آن ها خروجی استاندارد کد جاوا اسکریپت را به دست آورد. تایپ اسکریپت توسعه ی پروژه های جاوا اسکریپت را تا حد زیادی آسان می کند. مزایای TypeScript زمانی برای شما مشخص می شود که در پروژه ای بزرگ نیاز به استفاده از جاوا اسکریپت داشته باشید. TypeScript یک زبان برنامه نویسی است که توسط شرکت بزرگ Microsoft توسعه یافته و اکنون در بسیاری از پروژه‌ها با ابعاد و مقیاس بالا مورد استفاده قرار می گیرد و هم چنین با هر مرورگر و سیستم عاملی سازگار است. این زبان در اصل یک ابر مجموعه یا همان superset از زبان جاوا اسکریپت است؛ یعنی تمامی قابلیت‌ها و ابزارهای جاوا اسکریپت در آن دیده شده و علاوه بر آن قابلیت‌های بیشتری نیز دارد. ما از تایپ اسکریپت می توانیم در فریم ورک های Angular ، Vue.js ، React.js ، Express.js و Node.js بجای جاوا اسکریپت استفاده کنیم . هدف آن آسان شدن کد نویسی با استفاده از ویژگی های زبان های شی گرا با کم ترین میزان خطا برای برنامه های Back End و Front End می باشد. سینتکس تایپ اسکریپت شباهت زیادی به جاوا اسکریپت دارد و حتی می توانید با تغییر پسوند کدهای جاوا اسکریپت به TS از آن ها به عنوان کدهای تایپ اسکریپت استفاده نمایید.هدر این زبان برای ماژول های پایه Node.js در دسترس بوده و با استفاده از آن می توانید برنامه های نود جی اس را در تایپ اسکریپت توسعه دهید. TypeScript با کتابخانه های پرطرفدار جاوا اسکریپت نظیر ReactJS و jQuery کاملا سازگار بوده و خروجی آن با انواع مرورگرها سازگاری دارد. تایپ اسکریپت برای توسعه برنامه های AngularJS 2 مناسب بوده و در واقع برای نوشتن کدهای جاوا اسکریپت در انگولار باید از کدهای زبان TypeScript استفاده شود.'
                },
                {
                    id: 2,
                    title: 'ویژگی های TypeScript',
                    text: 'زبان برنامه نویسی TypeScript نمونه ی حرفه ای از جاوا اسکریپت بوده و به صورت JS ساده کامپایل می شود. با استفاده از آن به راحتی می توانید کدهای خود را خطایابی کرده و آن ها را رفع کنید. شناسایی خطاها قبل از اجرای کد باعث شده تا فرآیند خطایابی در زمان کوتاه تری صورت پذیرد؛ همین امر یکی از دلایل محبوبیت TypeScript است. در واقع این زبان مدیریت کدها را آسان تر می کند و به شما اجازه می دهد کدهای تمیزتری بنویسید. زبان برنامه نویسی تایپ اسکریپت در هر محیطی که جاوا اسکریپت ران می شود قابلیت اجرا دارد و نیازی به VM اختصاصی برای اجرا ندارد. یکی دیگر از ویژگی های این زبان آن است که از Static Typing پشتیبانی می کند؛ یعنی کامپایلر بین انواع داده ها تمایز قایل شده و باعث می شود تا برنامه ای خواناتر داشته باشیم.'
                },
                {
                    id: 3,
                    title: 'بازار کار تایپ اسکریپت',
                    text: 'زبان برنامه نویسی تایپ اسکریپت یکی از بهترین انتخاب‌ها برای برنامه نویسی در مقیاس بزرگ‌تر است. زیرا این زبان از بسیاری از خطاهایی که در حین اجرای برنامه رخ می‌دهد جلوگیری می‌کند. همچنین نگهداری و توسعه کدها را خیلی راحت‌تر کرده است. زمانی که در یک شرکت چندین نفر روی یک پروژه فعالیت می‌کنند سرعت و هماهنگی نقش بسیار مهمی دارد که تایپ اسکریپت همه این‌ موارد را فراهم می‌ کند و همچنین افراد متخصص در تایپ اسکریپت میتوانند در شرکت‌های بزرگ مشغول به کار شوند. مزیت دیگری که برای متخصصان این حوزه وجود دارد این است که می‌توانند به بصورت دورکاری با شرکت‌های بسیار خوب و معتبر داخلی یا خارجی نیز همکاری داشته باشند و اکثر شرکت های داخلی و خارجی یکی از مهارت های اصلی و پایه ی آنها برای استخدام تسلط به تایپ اسکریپت میباشد'
                },
                {
                    id: 4,
                    title: 'پیش نیاز دوره ی تایپ اسکریپت',
                    text: 'پیشنیاز این دوره تسلط متوسط بر زبان جاوا اسکریپت می باشد که مشکلی در روند آموزشی شما عزیزان پیش نیاید'
                },
                {
                    id: 5,
                    title: 'پشتیبانی دوره',
                    text: 'یکی از موضوعات بسیار مهم در بوتواستارت پشتیبانی دوره‌ها می‌باشد که برعهده مدرس دوره (عرفان یوسفی) است. مدرس به عنوان یک منتور و همراه از ابتدای مسیر قدم به قدم، تا زمانی که دانشجو تمامی مطالب را بصورت کامل یاد بگیرد، همراه اوست تا در تمامی روزهای هفته، حتی روزهای تعطیل به سوالات دانشجویان پاسخ دهد. این ارتباط مستقیم از طریق اکانت های واتس‌اپ - تلگرام و اینستاگرام انجام می‌گیرد.'
                },
            ],
            Support: true,
            description: 'TypeScript یک زبان برنامه نویسی است که توسط شرکت بزرگ Microsoft توسعه یافته و اکنون در بسیاری از پروژه‌ها با ابعاد و مقیاس بالا مورد استفاده قرار می گیرد و هم چنین با هر مرورگر و سیستم عاملی سازگار است',
        },
        {
            id: 2,
            teacherId: 2,
            image: 'https://www.freecodecamp.org/news/content/images/2022/11/What-is.png',
            posterVideo: 'https://botostart.org/images/posters/node.png',
            videoSrc: 'https://botostart.org/courses/other/node/videos/nodejs-starter-01.mp4',
            name: 'node-js',
            title: 'دوره جامع NodeJs و Express',
            horse: 50,
            student: 570,
            price: 2398000,
            numberSessions : 332,
            controversialQuestions:[
                {
                    id: 1,
                    title: 'مباحث ازصفر گفته شده؟',
                    text: 'بله، در این دوره تمام مباحث و مفاهیم جاوااسکریپت و Node از صفر گفته شده و نیاز به هیچ دانش قبلی نیست.'
                },
                {
                    id: 2,
                    title: 'پیشنیاز دارد؟',
                    text: 'خیر، برای شروع این دوره به هیچ دانسته قبلی نیاز ندارید و تمام مفاهیم از صفر تا پیشرفته گفته شده است.'
                },
                {
                    id: 3,
                    title: 'اگر در حین دیدن دوره به مشکلی خوردم چیکار کنم؟ پشتیبانی دارد؟',
                    text: 'صددرصد، دوره پشتیبانی دایمی دارد. یعنی چه در حین آموزش یا مصاحبه های استخدامی و حتی بعد از استخدام و پروژه گرفتن نیز میتوانید تمام سوال هایتان را بپرسید.'
                },
                {
                    id: 4,
                    title: 'دوره پروژه محور است؟',
                    text: 'به نظر من یک آموزش زمانی منجر به یادگیری و تسلط میشود که با پروژه همراه باشد به همین دلیل هم چندین پروژه مهم و کاربردی داخل دوره کار شده.'
                },
                {
                    id: 5,
                    title: 'دوره آپدیت است؟',
                    text: 'بله، دوره کاملا آپدیت است و همچنین مباحثی که مورد نیاز دانشجو ها باشد و یا استفاده ازشون در پروژه ها رو به افزایش باشد نیز به دوره اضافه خواهد شد '
                },
            ],
            questions: [
                {
                    id: 1,
                    title: 'Node JS چیست؟',
                    text: 'یک محیط اجرای جاوااسکریپت در سمت سرور میباشد که میتوانیم جاوااسکریپت را در خارج از مرورگر و در یک سرور اجرا کنیم و بتوانیم برنامه نویسی سمت سرور باهاش انجام بدیم. در واقع با کمک Node JS میتوانیم بک اند سایت را با جاوااسکریپت پیاده سازی بکنیم'
                },
                {
                    id: 2,
                    title: 'چرا Node JS؟',
                    text: 'Node JS این امکان را به ما داده که از طریق جاوااسکریپت به فایل ها دسترسی(i/o) داشته باشیم همچنین با دیتابیس در تعامل باشیم و چون Node JS دارای امکان برنامه نویسی متقارن و نامتقارن (Async/Sync) و همچنین event emitter می باشد باعث میشود که سرعت اجرای برنامه های Node JS به شدت بالا برود. Node JS مقیاس پذیری بالایی دارد یعنی پرفورمنسی را که برای 10 نفر دارد همان پرفورمنس را برای 10 هزار نفر نیز دارد. جامعه برنامه نویسان Node JS بسیار بزرگ است و گروه ها و فروم های متعددی برای پرسسش و پاسخ دارد. در Node JS ما به تعداد بسیار زیادی از پکیج ها دسترسی داریم که کار ما را بسیار راحتتر و سریعتر میکند'
                },
                {
                    id: 3,
                    title: 'بازار کار؟',
                    text: 'Node JS از بازار کار خیلی خوبی برخوردار است و خیلی از استارتاپ ها و کمپانی های بزرگ ایران از Node JS استفاده میکنند. حقوق برنامه نویسان این تکنولوژی از سطح جونیور گرفته تا سینیور عدد قابل توجهی است'
                },
                {
                    id: 4,
                    title: 'پیشنیاز دوره؟',
                    text: 'این دوره به هیچ پیشنیاز و دانش برنامه نویسی نیاز ندارد و تمام مباحث از صفر پوشش داده شده است'
                },
                {
                    id: 5,
                    title: 'چه مباحثی در دوره گفته شده است؟',
                    text: '',
                    listText: [
                        {
                            id: 1,
                            title: 'جاوااسکریپت از صفر تا پیشرفته',
                        },
                        {
                            id: 2,
                            title: 'Node JS از صفر تا پیشرفته و انجام پروژه Restful api با آن',
                        },
                        {
                            id: 3,
                            title: 'کار با هر سه مدل پایگاه داده SQL ، no-SQL و caching شامل MongoDB و MySQL و Redis',
                        },
                        {
                            id: 4,
                            title: 'آموزش کامل فریم ورک Express JS و انجام پروژه های متعدد با آن که در پایین به آن ها اشاره شده است',
                        },
                        {
                            id: 5,
                           title: 'کار با رمز یکبار مصرف (SMS)',
                        },
                        {
                            id: 6,
                           title: 'آموزش GraphQL',
                        },
                        {
                            id: 7,
                            title: 'آموزش Socket.io',
                        },
                        {
                            id: 8,
                            title: 'فریم ورک Fastify',
                        },
                        {
                            id: 9,
                            title: 'کار با فریم ورک Koa.js',
                        },
                        {
                            id: 10,
                            titel: 'آموزش Elastic search',
                        },
                        {
                            id: 11,
                            title: 'و …'
                        },
                    ]
                },
                {
                    id: 6,
                    title: 'مزیت های دوره:',
                    text: 'این دوره جامع و کامل هست به صورتی که دانشجو با شرکت در این دوره نیاز به هیچ دوره دیگری نخواهد داشت و در همین دوره با Node JS و تکنولوژی های آن به صورت پروژه محور آشنا میشود',
                },
                {
                    id: 7,
                    title: 'پروژه ها:',
                    text: '',
                    listText: [
                        {
                            id: 1,
                            title: 'سیستم Restful api همراه با آپلود فایل در pure Node JS',
                        },
                        {
                            id: 2,
                            title: 'سیستم Task Manager همراه با احراز هویت و آپلود فایل و کار با MongoDB در Express JS',
                        },
                        {
                            id: 3,
                            title: 'وبسایت فروشگاهی، کار با درگاه پرداخت و رمز یکبار مصرف(SMS)',
                        },
                        {
                            id: 4,
                            title: 'اضافه کردن Elastic Search به پروژه فروشگاهی',
                        },
                        {
                            id: 5,
                           title: 'وبلاگ و سیستم مدیریت محتوا(CMS)',
                        },
                        {
                            id: 6,
                           title: 'سیستم پیامرسان با Redis و Socket.io',
                        },
                        {
                            id: 7,
                            title: 'اضافه کردن پروژه کار با GraphQL درسیستم فروشگاهی',
                        },
                        {
                            id: 8,
                            title: 'Design Pattern ها در Node js و جاوااسکریپت',
                        },
                        {
                            id: 9,
                            title: 'پیاده سازی ساختار یک پروژه با MySQL',
                        },
                        {
                            id: 10,
                            title: 'انجام پروژه بک اند سایت کوئرا (قسمت استخدامی و ارسال رزومه با فریم ورک Koa.js)',
                        },
                        {
                            id: 11,
                            title: 'پیاده سازی پروژه مشاور املاک با Fastify با امکاناتی مانند پیدا کردن ملک در محدوده، افزودن آگهی و …',
                        }


                    ]
                },
            ],
            Support: true,
            description: 'نود جی اس یک محیط اجرایی سمت سرور برای زبان جاوااسکریپت است. یعنی Node به ما این امکان را میدهد تا با جاواسکریپت برنامه های سمت سرور و بک اند را توسعه بدیم. یکی از محبوب ترین و پر استفاده ترین فریم های ورک های سمت سرور نیز Express JS است که همراه با Nodeدر این دوره به صورت کامل پوشش داده شده است',
        },
        {
            id: 3,
            teacherId: 1,
            image: 'https://blog.knoldus.com/wp-content/uploads/2022/06/redux.jpg',
            posterVideo: 'https://botostart.org/images/posters/react.png',
            videoSrc: 'https://botostart.org/courses/other/react/videos/1-%20react%20course%20intro.mp4',
            name: 'react-js',
            title: 'دوره جامع متخصص ری اکت و ریداکس + ریکت ورژن 18',
            horse: 40,
            student: 2015,
            price: 2298000,
            numberSessions : 221,
            controversialQuestions: [
                {
                    id: 1,
                    title: 'مباحث از صفر گفته شده است؟',
                    text: 'بله، در این دوره تمام مباحث و مفاهیم ریکت از صفر گفته شده و نیاز به هیچ دانش قبلی راجع به ریکت نیست.'
                },
                {
                    id: 2,
                    title: 'پیشنیاز دارد؟',
                    text: 'همانطور که گفتم مباحث خود ریکت به صورت کامل پوشش داده شده است اما نیازه که قبل از شروع ریکت پیشنیاز های اون ینی جاوااسکریپت و HTML&CSS رو در حد خوبی بلد باشید.'
                },
                {
                    id: 3,
                    title: 'اگر در حین دیدن دوره به مشکلی خوردیم چیکار کنیم؟ پشتیبانی دارد؟',
                    text: 'صددرصد، دوره پشتیبانی دایمی دارد. یعنی چه در حین آموزش یا مصاحبه های استخدامی و حتی بعد از استخدام و پروژه گرفتن نیز میتوانید تمام سوال هایتان را بپرسید.'
                },
                {
                    id: 4,
                    title: 'دوره پروژه محور است؟',
                    text: 'به نظر من یک آموزش زمانی منجر به یادگیری و تسلط میشود که با پروژه همراه باشد به همین دلیل هم چندین پروژه مهم و کاربردی داخل دوره کار شده'
                },
                {
                    id: 5,
                    title: 'دوره آپدیت است؟',
                    text: 'بله، دوره کاملا آپدیت است و تمام تکنولوژی های روز دنیا مثل ریکت ورژن ۱۸ و react-router-dom ورژن ۶ به دوره اضافه شده است. '
                },
                {
                    id: 6,
                    title: 'منظور از وبینار های هفتگی چیه؟',
                    text: 'هر هفته برای دانشجو ها وبینار برگزار خواهد شد تا هم به مشکلات جمعی رسیدگی شود و هم انگیزه ای باشد برای ادامه کار.'
                },
            ],
            questions: [
                {
                    id: 1,
                    title: 'ری‌اکت چیست؟',
                    text: 'ری‌اکت یک کتابخانه محبوب و پرطرفدار جاوااسکریپت برای ساخت رابط کاربری و توسعه فرانت است، این کتابخانه توسط Facebook پشتیبانی میشود و در پروژه های بزرگی مانند Instagram و Twitter و Paypal استفاده شده است.'
                },
                {
                    id: 2,
                    title: 'چرا ری‌اکت مهم است؟',
                    text: 'ممکنه خیلی از برنامه نویس ها مهارت هایی مثل HTML&CSS و جاوااسکریپت رو داشته باشند که البته برای یک توسعه دهنده فرانت‌اند این مهارت ها کاملا مهم و ضروری است. اما باید دقت کنید که امروزه بدون شک برای توسعه هر سایتی علاوه بر جاوااسکریپت، از فریم ورک ها و لایبرری های جاوااسکریپت هم استفاده میشود، پس باید با ابزار های به روز و پرکاربرد آشنایی داشته باشید.'
                },
                {
                    id: 3,
                    title: 'وضعیت بازار کار؟',
                    text: 'به جرات میتوان گفت که ری‌اکت چه در ایران و چه در خارج از ایران بازار کار فوق العاده ای دارد و روز به روز نیاز به توسعه دهندگان ری‌اکت بیشتر میشود.'
                },
                {
                    id: 4,
                    title: 'پیشنیاز دوره؟',
                    text: 'بدون شک برای شروع ری‌اکت نیاز است که با مباحث HTML&CSS و جاوااسکریپت آشنایی داشته باشید.'
                },
                {
                    id: 5,
                    title: 'ویژگی های دوره:',
                    listText: [
                        {    
                            id: 1,
                            title:'پوشش کامل مباحث ری‌اکت از مقدماتی تا پیشرفته(class component ها، functional component ها، وبسایت های تک صفحه ای(SPA)، درخواست های https و ajax در ری‌اکت و …)جاوااسکریپت از صفر تا پیشرفته',
                        },
                        {
                            id: 2,
                            title:'پروژه محور بودن دوره (پروژه های کاربردی که در پروژه های واقعی هم پیاده میشوند)',
                        },
                        {
                            id: 3,
                            title:'آپدیت بودن دوره(شامل ریکت ورژن ۱۸ و react-router-dom ورژن ۶)',
                        },
                        {
                            id: 4,
                            title:'پوشش مباحث مربوط به Redux - Redux-thunk در پایان همین دوره.',
                        },
                        {
                            id: 5,
                            title:'آموزش GraphQL و انجام پروژه وبلاگ',
                        },
                        {
                            id: 6,
                            title:'مشورت با برنامه نویس هایی که سابقه کار در اسنپ را داشتن تا مباحث به صورت کامل پوشش داده شوند.',
                        },
                        {
                            id: 7,
                            title:'بررسی مفاهیم مهم و کاربردی ری‌اکت و همچنین استفاده از آن در پروژه های دوره.',
                        },
                        {
                            id: 8,
                            title:'دیپلوی کردن پروژه ها بر روی هاست های رایگان.',
                        },
                        {
                            id: 9,
                            title:'و …',
                        }
                    ]
                },
                {
                    id: 6,
                    title: 'مزیت های دوره:',
                    listText: [
                        {
                            id: 1,
                            title: 'این دوره پشتیبانی دائمی دارد و همیشه پاسخگوی سوالات دانشجویان خواهم بود.',
                        },
                        {
                            id: 2,
                            title: 'با آپدیت های جدید ری‌اکت این دوره هم آپدیت خواهد شد و به صورت رایگان در اختیار دانشجویان دوره قرار خواهد گرفت.',
                        },
                        {
                            id: 3,
                            title: 'در صورت تقاضای دانشجویان قسمت های جدید بسته به نیاز آن ها اضافه خواهد شد.',
                        },
                        {
                            id: 4,
                            title: 'پذیرای انتقادات و پیشنهادات شما هستم و همیشه سعی در ارتقای دوره ها خواهم داشت.',
                        },
                        {
                            id: 5,
                            title: 'برای کسانی که اول راه برنامه نویسی هستند مشاوه رایگان در نظر گرفته شده است (پس دقت کنید که در حین ثبت نام شماره درست را وارد کنید تا از طریق آن در ارتباط باشیم)',
                        },
                        {
                            id: 6,
                            title: 'و …'
                        },
                    ]
                },
                {
                    id: 7,
                    title: 'به دوره دیگری نیاز خواهم داشت؟',
                    text: 'قطعا نه، هر آنچه که برای تسلط شما به ری‌اکت و ورود به بازار کار لازم است در این دوره گفته شده است و بعد از این دوره به مهارت بالایی خواهید رسید که شما را از هر دوره دیگری بی نیاز میسازد.'
                },
                {
                    id: 8,
                    title: 'پروژه ها:',
                    listText: [
                        {
                            id: 1,
                            title: 'وبسایت فروشگاهی که به صورت SPA هست و از api داخل آن استفاده شده است.',
                        },
                        {
                            id: 2,
                            title: 'سبد خرید با استفاده از context و useReducer',
                        },
                        {
                            id: 3,
                            title: 'سبد خرید با استفاده از Redux و redux-thunk',
                        },
                        {
                            id: 4,
                            title: 'صرافی ارز دیجیتال برای نشان دادن قیمت ارز های دیجیتال و قابلیت سرچ کردن(دیتا ها از api واقعی گرفته میشود)',
                        },
                        {
                            id: 5,
                            title: 'فرم ثبت نام و ورود به همراه اعتبار سنجی.',
                        },
                        {
                            id: 6,
                            title: 'پیامرسان شبیه واتساپ با قابلیت چت بین چند نفر، ساختن گروه، ارسال عکس و… .',
                        },
                        {
                            id: 7,
                            title: 'پروژه وبلاگ با قابلیت مدیریت محتوا، کامنت گذاشتن برای هر مقاله، صفحه نویسنده و ...',
                        }
                    ]
                },                
                {
                    id: 9,
                    title: 'برای مصاحبه های شغلی هم مفید خواهد بود؟',
                    text: 'در انتهای دوره به بررسی سوالات مصاحبه ری‌اکت میپردازیم و یک سری نکات تجربی هم گفته میشود و همچنین همیشه میتوانید برای رفع مشکل هایتان از پشتیبانی استفاده کنید'
                },
            ],
            Support: true,
            description: 'بی شک ریکت یکی از محبوب ترین لایبرری ها برای طراحی UI است. این لایبرری توسط فیسبوک پشتیبانی میشود و بازار کار و کامیونیتی گسترده‌ای در ایران و سایر کشور ها دارد و یکی از انتخاب ها برای شروع یک مهارت به عنوان برنامه نویس Front end می باشد.',
        },
        {
            id: 4,
            teacherId: 1,
            image: 'http://radvingroup.com/images/tasavir/bakhsh1/javascript/javascript_logo.jpg',
            posterVideo: 'https://botostart.org/images/posters/javascript.png',
            videoSrc: 'https://botostart.org/courses/other/javascript/videos/1-%20introduction.mp4',
            name: 'javascript',
            title: 'دوره مقدماتی تا پیشرفته جاوااسکریپت',
            horse: 25,
            student: 2559,
            price: 1329000,
            numberSessions : 88,
            controversialQuestions: [
                {
                    id: 1,
                    title: 'مباحث از صفر گفته شده است؟',
                    text: 'بله، در این دوره تمام مباحث و مفاهیم جاوااسکریپت از صفر گفته شده و نیاز به هیچ دانش قبلی راجع به جاوااسکریپت نیست.'
                },
                {
                    id: 2,
                    title: 'پیشنیاز دارد؟',
                    text: 'قبل از شروع این دوره حتما HTML&CSS را در سطح متوسط یاد بگیرید.'
                },
                {
                    id: 3,
                    title: 'اگر در حین دیدن دوره به مشکلی خوردیم چیکار کنیم؟ پشتیبانی دارد؟',
                    text: 'صددرصد، دوره پشتیبانی دایمی دارد. یعنی چه در حین آموزش یا مصاحبه های استخدامی و حتی بعد از استخدام و پروژه گرفتن نیز میتوانید تمام سوال هایتان را بپرسید.'
                },
                {
                    id: 4,
                    title: 'دوره پروژه محور است؟',
                    text: 'به نظر من یک آموزش زمانی منجر به یادگیری و تسلط میشود که با پروژه همراه باشد به همین دلیل هم چندین پروژه مهم و کاربردی داخل دوره کار شده.'
                },
                {
                    id: 5,
                    title: 'دوره آپدیت است؟',
                    text: 'بله، دوره کاملا آپدیت است و همچنین مباحثی که مورد نیاز دانشجو ها باشد و یا استفاده ازشون در پروژه ها رو به افزایش باشد نیز به دوره اضافه خواهد شد'
                },
                {
                    id: 6,
                    title: 'منظور از وبینار های هفتگی چیه؟',
                    text: 'هر هفته برای دانشجو ها وبینار برگزار خواهد شد تا هم به مشکلات جمعی رسیدگی شود و هم انگیزه ای باشد برای ادامه کار.'
                },
            ],
            questions: [
                {
                    id: 1,
                    title: 'چرا برنامه نویسی؟',
                    text: 'توی شرایط اقتصادی فعلی که همه ما درگیر آن هستیم داشتن شغل مناسب با درآمد کافی بسیار مهم است، شغلی که هم شان اجتماعی داشته باشد و هم روش های مختلفی را برای درآمد در اختیار شما بگذارد. بر کسی پوشیده نیست که برنامه نویسی یکی پرتقاضا ترین مهارت ها هم در داخل کشور و هم در خارج از کشور است چرا که در تمام صنعت ها مورد استفاده قرار میگیرد و مهارتی است که روز به روز بیشتر مورد توجه قرار میگیرد و تقاضا برای آن بیشتر میشود. اما برای کار در این حرفه پردرآمد نیاز به مهارت های بالا و به روز دارید تا بتوانید در فضای رقابتی امروز از بقیه پیشی بگیرید و به عنوان یک برنامه نویس سینیور در شرکت ها و استارتاپ های برزرگ مشغول به کار شوید.'
                },
                {
                    id: 2,
                    title: 'در این دوره چه آموزش داده می شود؟',
                    text: 'بدون شک جاوااسکریپت یکی از پرطرفدار ترین و کاربردی ترین زبان های دنیاست که در زمینه های مختلفی از جمله طراحی وب (فرانت اند و بک اند)، اپلیکیشن های موبایل، بازی و… کاربرد دارد. با این اوصاف میتوان به قدرت و محبوبیت و بازار کار جاوااسکریپت پی برد. هدف این پروژه آموزش پروژه محور جاوااسکریپت است، به صورتی که 7 پروژه مفید و کاربردی و چندین تمرین در طول این دوره ۲۵ ساعته حل و تشریح خواهد شد. تمام تلاشم را کرده ام که دوره ای کامل و جامع منتشر کنیم تا نیاز به دوره ی دیگری نداشته باشید و زمانتان که با ارزش ترین داراییتان است بیهوده تلف نشود و در کمترین زمان ممکن به درک خوبی از جاوااسکریپت برسید.'
                },
                {
                    id: 3,
                    title: 'یادگیری یک زبان برنامه نویسی سخت است؟',
                    text: 'قطعا هر کاری سختی های خودش را دارد اما چیزی که در یادگیری یک زبان برنامه نویسی مهم است درک مفاهیم و تمرین میباشد. در این دوره سعی کردم تا با ساده ترین زبان ممکن مفاهیم را توضیح دهم و در مرحله بعد داخل پروژه ها آن هارا به کار میبریم تا دید بهتری پیدا کنید. هدف این دوره آسان کردن یادگیری جاوااسکریپت است.'
                },
                {
                    id: 4,
                    title: 'مزیت های این دوره؟',
                    listText: [
                        {
                            id: 1,
                            title: 'این دوره پشتیبانی دائمی دارد و همیشه پاسخگوی سوالات دانشجویان خواهیم بود.',
                        },
                        {
                            id: 2,
                            title: 'با آپدیت های جدید برنامه ها این دوره نیز آپدیت میشود و به صورت رایگان در اختیار دانشجویان دوره قرار خواهد گرفت.',
                        },
                        {
                            id: 3,
                            title: 'پذیرای انتقادات و پیشنهادات شما هستیم و همیشه سعی در ارتقای دوره ها خواهیم داشت.',
                        },
                        {
                            id: 4,
                            title: 'در صورت نیاز و تقاضای دانشجویان قسمت های جدید شامل تمرین و پروژه به دوره اضافه خواهد شد.',
                        },
                        {
                            id: 5,
                            title: 'برای کسانی که اول راه برنامه نویسی هستند مشاوره رایگان در نظر گرفته شده است(پس در حین ثبت نام شماره تماس درست را وارد کنید تا از آن طریق در ارتباط باشیم).',
                        },
                        {
                            id: 6,
                            title: 'و …'
                    },]

                },
                {
                    id: 5,
                    title: 'با وجود ریکت، ویو و انگولار؛ یادگیری جاوااسکریپت ضروری است؟',
                    text: 'اشتباه ترین کار ممکن این است که قبل از یادگیری جاوااسکریپت سراغ تکنولوژی هایی مانند ریکت بروید. این ها فریم ورک ها و لایببری های جاوااسکریپت هستند و نیازه تا قبل از شروع هر کدام حتما جاوااسکریپت را به خوبی یاد بگیرید'
                },
            ],
            Support: true,
            description: 'بهتر است از این زبان به عنوان آچار فرانسه یاد کنیم. زبانی که به ما این امکان را میدهد تا برنامه های تحت وب(فرانت اند و بک اند)، موبایل(android و ios)،دسکتاپ، بازی و ... راتوسعه بدهیم و همین امر باعث شده تا محبوبیت زیاده داشته باشد و البته این محبوبیت در نهایت منجر به بازار کار فوق العاده آن میشود.'
        },
        {
            id: 5,
            teacherId: 1,
            image: 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQdZYQI8LT5dj-JtigkV0OChgQpF8vZu0WuDytjbrsYqVkU6I8hszevXDqQ_VCAa-gyNNk&usqp=CAU',
            posterVideo: 'https://botostart.org/images/posters/html-css.png',
            videoSrc: 'https://botostart.org/courses/other/html-css/videos/0-%20%D9%85%D9%82%D8%AF%D9%85%D9%87.mp4',
            name: 'html-css',
            title: 'دوره جامع HTML و CSS',
            horse: 17,
            student: 2377,
            price: 429000,
            numberSessions : 119,
            controversialQuestions: [
                {
                    id: 1,
                    title: 'مباحث از صفر گفته شده است؟',
                    text: 'بله، در این دوره تمام مباحث و مفاهیم HTML&CSS از صفر گفته شده و نیاز به هیچ دانش قبلی راجع به HTML&CSS نیست.'
                },
                {
                    id: 2,
                    title: 'پیشنیاز دارد؟',
                    text: 'خیر برای این دوره هیچ پیشنیازی لازم نیست در حدی که بشه کامپیوتر رو روشن خاموش کنی کافیه(این تیکه خیلی محاوره ای شد)'
                },
                {
                    id: 3,
                    title: 'اگر در حین دیدن دوره به مشکلی خوردیم چیکار کنیم؟ پشتیبانی دارد؟',
                    text: 'صددرصد، دوره پشتیبانی دایمی دارد. یعنی چه در حین آموزش یا مصاحبه های استخدامی و حتی بعد از استخدام و پروژه گرفتن نیز میتوانید تمام سوال هایتان را بپرسید.'
                },
                {
                    id: 4,
                    title: 'دوره پروژه محور است؟',
                    text: 'به نظر من یک آموزش زمانی منجر به یادگیری و تسلط میشود که با پروژه همراه باشد به همین دلیل هم چندین پروژه مهم و کاربردی داخل دوره کار شده'
                },
                {
                    id: 5,
                    title: 'دوره آپدیت است؟',
                    text: 'بله، دوره کاملا آپدیت است و همچنین مباحثی که مورد نیاز دانشجو ها باشد و یا استفاده ازشون در پروژه ها رو به افزایش باشد نیز به دوره اضافه خواهد شد'
                },
                {
                    id: 6,
                    title: 'منظور از وبینار های هفتگی چیه؟',
                    text: 'هر هفته برای دانشجو ها وبینار برگزار خواهد شد تا هم به مشکلات جمعی رسیدگی شود و هم انگیزه ای باشد برای ادامه کار.'
                },
            ],
            questions: [
                {
                    id: 1,
                    title: 'چرا برنامه نویسی وب؟',
                    text: 'هر ایده، استارتاپ، شرکت و ...ای به سایت نیاز دارد و به راحتی میتوان مصداق این جمله را در دنیای پیرامون ببینیم. این امر باعث شده که سایت اهمیت ویژه ای برای کسب و کار ها داشته باشد. با کمی فکر کردن میتوانیم به این نتیجه برسیم که نیاز به برنامه نویس وب روز به روز در حال افزایش است پس قطعا سرمایه گذاری در چنین حوزه ای و یادگیری آن میتواند قدم بزرگی برای آینده به حساب آید.'
                },
                {
                    id: 2,
                    title: 'در این دوره چه آموزش داده می شود؟',
                    text: 'بی شک اولین قدم برای شروع برنامه نویسی در حوزه وب یادگیری اصولی مبحث HTML و CSS است. ما در این دوره سعی کردیم با بیانی ساده و زدن مثال و تمرین کردن چندین پروژه این امر را به نحو احسن به انجام برسانیم. در این دوره همه چیز از صفر گفته میشود و حتی ساده ترین موارد مثل دانلود کردن برنامه های مورد استفاده پوشش داده شده است. تمام مباحث که برای تبدیل شدن به یک برنامه نویس حرفه ای لازم است در این دوره به صورت کامل آورده شده است و شمارا بی نیاز از دیدن چندین دوره آموزشی میکند.'
                },
                {
                    id: 3,
                    title: 'پیش نیاز های این دوره آموزشی؟',
                    text: 'این دوره نیاز به هیچ پیشنیازی ندارد چرا که همه مطالب به صورت گام به گام توضیح داده شده است. تنها پیشنیاز این دوره عزم و اراده شما برای تبدیل شدن به یک برنامه نویس حرفه ای است.'
                },
                {
                    id: 4,
                    title: 'مزیت های این دوره؟',
                    listText: [
                        {
                            id: 1,
                            titel: 'این دوره پشتیبانی مادام العمر دارد و همیشه پاسخگوی سوالات دانشجویان خواهیم بود.',
                        },
                        {
                            id: 2,
                            title: 'با آپدیت های جدید برنامه ها این دوره نیز آپدیت میشود و به صورت رایگان در اختیار دانشجویان دوره قرار خواهد گرفت.',
                        },
                        {
                            id: 3,
                            titel:'پذیرای انتقادات و پیشنهادات شما هستیم و همیشه سعی در ارتقای دوره ها خواهیم داشت.',
                        },
                        {
                            id: 4,
                            titel:'در صورت نیاز و تقاضای دانشجویان قسمت های جدید شامل تمرین و پروژه به دوره اضافه خواهد شد.',
                        },
                        {
                            id: 5,
                            titel:'برای کسانی که اول راه برنامه نویسی هستند مشاوره رایگان در نظر گرفته شده است(پس در حین ثبت نام شماره تماس درست را وارد کنید تا از آن طریق در ارتباط باشیم)',
                        },
                        {
                            id: 6,
                            titel:'و …',
                        }
                    ]
                },
                {
                    id: 5,
                    title: 'هدف از دوره؟',
                    text: 'احتمالا دیده باشید که در خیلی از دوره ها مباحث قدیمی و بدون استفاده مانند float گفته شده اما به مباحث بروزی مانند Flex و Grid اهمیت داده نشده است. این دوره دقیقا برای پر کردن این خلا ها است تا مباحث آپدیت و به روز که مورد نیاز بازار کار است به شما ارایه داده شود.'
                },
                {
                    id: 6,
                    title: 'برای تسلط بیشتر چه کنیم؟ ',
                    text: 'هر چیزی که نیاز باشد برای شما آماده شده است. در این دوره چندین پروژه واقعی انجام شده تا با نحوه استفاده از پراپرتی های CSS و همچنین layoutبندی کردن صفحات آشنا بشوید.'
                },
            ],
            Support: true,
            description: 'اولین قدم برای ورود به دنیای برنامه نویسی وب و فرانت اند یادگیری HTML&CSS است که به ما این امکان را میدهد تا ظاهر استاتیک سایت را پیاده بکنیم. منظور از پیاده سازی ظاهر طراحی با ابزار هایی مثل Adobe XD و .. نیست. این یک مهارت جدا است که توسط شخص دیگری انجام میشود و وظیفه شما پیاده سازی دقیق طرح گرافیکی به وسیله کد های HTML&CSS است.'
        },
        {
            id: 6,
            teacherId: 1,
            image: 'https://www.freecodecamp.org/news/content/images/2022/04/sass-image.png',
            posterVideo: 'https://botostart.org/images/posters/sass.png',
            videoSrc: 'https://botostart.org/courses/free/sass/videos/1-%20%D9%85%D8%B9%D8%B1%D9%81%DB%8C%20sass.mp4',
            name: 'sass',
            title: 'آموزش SASS',
            horse: '2/45',
            student: 4258,
            price: 0,
            numberSessions : 20,
            controversialQuestions: [
                {
                    id: 1,
                    title: 'مباحث از صفر گفته شده است؟',
                    text: 'بله، مباحث به صورت کامل از صفر پوشش داده شده است.'
                },
                {
                    id: 2,
                    title: 'پیشنیاز دارد؟',
                    text: 'آشنایی با HTML&CSS لازم و ضروری است.'
                },
            ],
            questions: [
                {
                    id: 1,
                    title: 'در این دوره چه آموزش داده میشود!؟',
                    text: 'یکی از مهارت هایی که بعضا خیلی مورد توجه کارفرماها قرار میگیرد و به آن اهمیت میدهند sass است.در این دوره سعی شده تا همانند دوره های قبلی تمام مفاهیم از صفر گفته شود. این دوره با مباحث مقدماتی مانند نصب vs code شروع شده و تا مطالب پیشرفته sass ادامه میابد و طبق روال دوره های قبلی بوتواستارت پروژه هم داخل این دوره انجام خواهد شد چرا که معتقدیم هیچ دوره آموزشی بدون تمرین و پروژه کامل نیست.'
                },
                {
                    id: 2,
                    title: 'یادگیری Sass ضروری است؟',
                    text: 'Sass از آن دسته تکنولوژی هایی هست که لزوما توی تمام پروژه ها استفاده نمیشود. ساده تر بخوام بگم بسته به نیاز پروژه ممکنه استفاده بشه یا نه ولی در کل دانستن آن نکته مثبتی در رزومه شما حساب میشود.'
                },
                {
                    id: 3,
                    title: 'چه مزیتی دارد؟',
                    text: 'همانطور که میدانید CSS یک زبان برنامه نویسی نیست اما Sass قابلیت هایی به آن میدهد که خیلی نزدیک به یک زبان میشود و همین امر باعث ساده تر شدن کار و زیاد شدن سرعت توسعه برنامه میشود.'
                },
                {
                    id: 4,
                    title: 'یادگیری آن سخت است؟',
                    text: 'اگر CSS را بلد باشید یادگیری Sass از چیزی که فکرش را میکنید راحتتر است. تمام پراپرتی هایی که در CSS استفاده میشود عینا در Sass هم تکرار میشوند و نیاز به یادگیری چیز جدید در این مورد نیست اما یک سری امکانات اضافه تر نسبت به CSS در اختیار ما قرار میدهد تا کار مارا راحت کند و همین هم دلیل استفاده از آن است و مطمين باشید خیلی زود این موارد رو یاد خواهید گرفت.'
                },
            ],
            Support: false,
            description: 'Sass یک پیش پردازنده برای css است که بسیاری از ضعف های آن را جبران میکند. و این کار را با داشتن قابلیت هایی مانند متغییر ها، Nesting، Mixin و … انجام می دهد.'
        },
        {
            id: 7,
            teacherId: 1,
            image: 'https://editor.analyticsvidhya.com/uploads/18288git.jpg',
            posterVideo: 'https://botostart.org/images/posters/git.png',
            videoSrc: 'https://botostart.org/courses/other/git/videos/1-%20git%20intro.mp4',
            name: 'github',
            title: 'دوره آموزش گیت، کیت هاب و کیت لب',
            horse: '2/5',
            student: 1994,
            price: 219000,
            numberSessions : 16,
            controversialQuestions: [
                {
                    id: 1,
                    title: 'مباحث از صفر گفته شده است؟',
                    text: 'بله، مباحث به صورت کامل از صفر پوشش داده شده است.'
                },
                {
                    id: 2,
                    title: 'پیشنیاز دارد؟',
                    text: 'بهتر است قبل از شروع با یک زبان برنامه نویسی آشنایی مختصری داشته باشید.'
                },
                {
                    id: 3,
                    title: 'اگر در حین دیدن دوره به مشکلی خوردیم چیکار کنیم؟ پشتیبانی دارد؟',
                    text: 'صددرصد، دوره پشتیبانی دایمی دارد. یعنی چه در حین آموزش یا مصاحبه های استخدامی و حتی بعد از استخدام و پروژه گرفتن نیز میتوانید تمام سوال هایتان را بپرسید.'
                },
                {
                    id: 4,
                    title: 'منظور از وبینار های هفتگی چیه؟',
                    text: 'هر هفته برای دانشجو ها وبینار برگزار خواهد شد تا هم به مشکلات جمعی رسیدگی شود و هم انگیزه ای باشد برای ادامه کار.'
                },
            ],
            questions: [
                {
                    id: 1,
                    title: 'گیت چیست؟',
                    text: 'گیت یک برنامه کنترل ورژن است که به کمک آن خیلی راحت میتوان پروژه را مدیریت کرد و به ورژن های مختلف برنامه دسترسی پیدا کرد. گیت خط به خط کدها و کسانی که آن ها را نوشته اند را ثبت میکند و یک تاریخچه کامل از توسعه برنامه ما فراهم میکند.'
                },
                {
                    id: 2,
                    title: 'چرا گیت مهم است؟',
                    text: 'عملا بدون گیت نمیتوان در هیچ تیمی همکاری کرد، از همین جمله میتوان فهمید که گیت برای همه حوزه های برنامه نویسی یک امر واجب است. به کمک گیت این امکان فراهم میشود که چند نفر بتوانند روی یک پروژه مشترک کار بکنند و البته یک ابزار مهم برای رزومه سازی هم محسوب میشود.'
                },
                {
                    id: 3,
                    title: 'به رزومه سازی کمک میکند؟',
                    text: 'شما با گیت خط به خط کدها و پروژه هایتان را ثبت میکنید و همچنین میتوانید از مخازنی که گیت هاب و گیت لب در اختیار شما قرار میدهند استفاده کنید تا محلی برای نگه داری و به اشتراک گذاشتن کد هایتان باشد. تا الان همه چیز خیلی ساده شده است، گیت به شما کمک میکند تا هر کاری که کردید را ثبت کنید و به بقیه ارایه بدید و این در مرحله استخدام به شما کمک میکند تا بتوانید پروژه ها و توانایی هایتان را ارایه بدید.'
                },
                {
                    id: 4,
                    title: 'یاد گرفتن گیت ضروریه؟',
                    text: 'گیت از نان شب برای یک برنامه نویس واجب تر است. مهم نیست که چه زبانی کار میکنید و یا تو چه حوزه ای فعالیت دارید، باید گیت را بلد باشید. در تمام تیم ها و پروژه ها استفاده میشود و خیلی از شرکت ها دانستن گیت را لازمه استخدام میدانند.'
                },
                {
                    id: 5,
                    title: 'پیشنیاز های دوره؟',
                    text: 'برای یادگیری گیت پیش نیاز خاصی لازم نیست، اگر در حد تغییر چند فایل هم اطلاعات دارید کفایت میکند ولی بهتر است حداقل با یک زبان برنامه نویسی آشنایی پیدا کنید و بعد یادگیری آن را شروع کنید.'
                },
            ],
            Support: true, 
            description: 'مهم نیست که تو چه حوزه و زبانی فعالیت میکنید، باید کار با گیت را بلد باشید. از گیت برای ورژن بندی کردن برنامه استفاده میشود و بدون آن کار تیمی خیلی سخت و غیرممکن میشود. و البته برای کسایی که در حال یادگیری هستن یکی از بهترین راه های جمع کردن نمونه کاراستفاده از گیت است.'
        },
        {
            id: 8,
            teacherId: 1,
            image: 'https://www.webdesignsun.com/wp-content/uploads/2021/07/Mobile-First-Design-Principles-1.jpg',
            posterVideo: 'https:/botostart.org/images/posters/mobile.png',
            videoSrc: 'https:/botostart.org/courses/free/mobile-first/videos/1-%20mobile%20first.mp4',
            name: 'mobile-first',
            title: 'آموزش Mobile First Design',
            horse: '0/5',
            student: 3278,
            price: 0,
            numberSessions : 3,
            controversialQuestions: [
                {
                    id: 1,
                    title: 'مباحث از صفر گفته شده است؟',
                    text: 'بله، مباحث به صورت کامل از صفر پوشش داده شده است.'
                },
                {
                    id: 2,
                    title: 'پیشنیاز دارد؟',
                    text: 'آشنایی با HTML&CSS لازم و ضروری است.'
                }
            ],
            questions: [
                {
                    id: 1,
                    title: 'در این دوره چه آموزش داده میشود!؟',
                    text: 'با توجه به اینکه درصد بالایی از کاربران سایت ها با گوشی کار میکنند اهمیت ریسپانسیو بودن سایت بسیار بالا رفته است و حتی بسیاری از وبسایت ها بنای طراحی رو بر روی سایز های کوچکتر مانند گوشی میگذارند. از این رو طراحی mobile first به وجود آمده و همانطور که از اسمش پیدا است اولویت را به گوشی های موبایل داده است. در mobile first ما با کد های عجیب و غریب سروکار نداریم و صرفا یک متد و مجموعه ای از قوانین است که هنگام طراحی سایت و ریسپانسیو کردن باید از آن ها پیروی بکنیم. در این دوره مفهوم mobile first توضیح داده میشود و سپس با هم یک پروژه رو پیاده میکنیم تا بهتر با مفاهیم آشنا شویم'
                },
                {
                    id: 2,
                    title: 'یادگیری Mobile First Design ضروری است؟',
                    text: 'با توجه به افزایش روزافزون کاربران موبایل بهتر است که توجه زیادی به این مساله داشته باشید و ۱۰۰ دردصد توصیه میکنم که این دوره کوتاه رو ببینید.'
                },
                {
                    id: 3,
                    title: 'پیش نیاز های این دوره آموزشی؟',
                    text: 'برای این دوره شما باید با HTML و CSS آشنا باشید(مانند flex و media query و …) چون تمرکز ما فقط بروی بحث mobile first است و در مورد کدهای HTML و CSS توضیح کامل داده نمیشود چون فرض بر این این است که شما آن ها را بلد هستید.'
                },
                {
                    id: 4,
                    title: 'یادگیری آن سخت است؟',
                    text: 'اگر کار با میدیا media query در CSS را بلد باشید خیلی ساده و سریع این مفهوم را یاد خواهید گرفت.'
                },
            ],
            Support: false,
            description: 'امروزه اکثر کاربر ها از طریق گوشی موبایل وارد سایت ها میشوند برای همین در بحث ریسپانسیو سازی مهمه که گوشی های موبایل در اولویت باشند.'
        },
    ],

    teacher : [
        {
            id: 1,
            img: 'https://botostart.ir/_next/image?url=%2F_next%2Fstatic%2Fmedia%2Fmilad.8723fa0e.png&w=256&q=100',
            name: 'میلاد عظیمی',
            job: 'برنامه نویس فرانت اند',
            descriptionTeacher: 'سلام بچه ها👋 من میلادم و از سال ۹۵ مشغول برنامه نویسی فرانت اند و ریکت هستم و همچنین در سال ۹۸ وارد حوزه آموزش نیز شدم و چندین دوره در سایت های بزرگ ایرانی منتشر کردم و در نهایت تصمیم به تدریس در پلتفرم اختصاصی خودم ینی بوتواستارت گرفتم. تمام تلاشم اینه تا دوره هایی رو بهتون ارایه بدم که علاوه بر مباحث مهم حاوی پروژه و تجربه باشه تا مسیر ورود شما به بازار کار رو راحتتر کنم'
        },
        {
            id: 2,
            img: 'https://botostart.ir/_next/image?url=%2F_next%2Fstatic%2Fmedia%2Ferfan.718d73c4.png&w=256&q=100',
            name: 'عرفان یوسفی',
            job: 'برنامه نویس بک اند',
            descriptionTeacher: 'سلام من عرفانم و از سال ۸۹‌ برنامه نویسی رو شروع کردم و با زبان های متخلفی کار کردم ولی از سال ۹۷ به صورت تخصصی روی جاوااسکریپت و Node.Js مشغول به کار شدم و در پروژه های مختلفی شرکت داشتم. من همچنین علاقه زیادی به تدریس داشتم و دوست دارم تجربه‌ای که توی این چند سال به دست آوردم رو در قالب دوره های کامل و پروژه محور منتشر کنم تا مشکلاتی که زمانی برای من مانع بودند را از سر راه شما بردارم'
        },
    ],


    aboutMe : [
        {
            id: 1,
            title: 'از برنامه نویسی راضی هستم؟',
            text: 'هر کاری سختی و چالش های خودشو داره و برنامه نویسی هم از این قاعده مستثنی‌نیست اما در کل از انتخابم واقعا راضیم. برنامه نویسی من رو وارد مسیری کرد که خیلی از محدودیت هارو برداشت و تونستم کار های مفیدی انجام بدم، انجام دادن کار های مفید که به نفع مردم هست همیشه بهترین حس رو به آدم میده.'
        },
        {
            id: 2,
            title: 'چرا برنامه نویسی انتخاب کردم؟',
            text: 'برای من برنامه نویسی خیلی ایده‌آل بود، شرایط کاری یکنواختی نداشت، باید با تکنولوژی های جدید خودمو آپدیت کنم، امکان کار به صورت ریموت (دورکاری) رو داره و برای منی‌ که شهرستان هستم عالی بود. و در نهایت واقعا از خلق کردن یک محصول و دیدن نتیجه نهایی لذت میبرم.'
        },
        {
            id: 3,
            title: 'چرا برنامه نویس شدم؟',
            text: 'سلام، من میلادم. سال ۹۴ رشته نفت قبول شدم و به هوای اینکه قراره آینده شغلی و مالی خوبی داشته باشم رفتم دانشگاه ولی همون ترم اول متوجه شدم که همه چی دقیقا برعکس تصوراتم بوده و اصلا اون چیزی نیست که فکرشو میکردم و همین جرقه‌ای شد که دنبال یک مهارت دیگه باشم و بعد از کلی تحقیق به برنامه نویسی رسیدم.'
        }
    ],

    studentsComments : [
        {
            id: 1,
            image: 'https://botostart.org/comments/amir-khosroshahi.png',
            name: 'سورنا گنجی',
            studentCourses: 'دانشجوی جاوااسکریپت و ریکت',
            text: 'این دوره، اولین انتخاب من نبود ولی وقتی بقیه دوره هارو رصد کردم دیدم مثل این دوره تو دوره های فارسی اصلا نیست. مباحث خیلی کامل و جامع گفته شده و پشتیبانی خیلی خوبی داره.یکی از خوبی ها استاد اینه که مباحث پیچیده رو خیلی ساده توضیح میدن و تو مراحل مصاحبه هم همراهم بودن.'
        },
        {
            id: 2,
            image: 'https://botostart.org/comments/sorena-ganji.png',
            name: 'امیر خسروشاهی',
            studentCourses: 'دانشجوی جاوااسکریپت و ریکت',
            text: 'من بعد از مشاهده دوره ها و پشت سر گذاشتن یه سری مصاحبه های فنی تونستم استخدام بشم. تموم نکاتی رو که دوره گفتی تو مصاحبه پرسیدن و تونستم به خوبی قبول بشم.'
        },
        {
            id: 3,
            image: 'https://botostart.org/comments/samira-farokhnezhad.png',
            name: 'سمیرا فرخ نژاد(ساکن استالیا)',
            studentCourses: 'دانشجوی جاوااسکریپت و ریکت',
            text: 'من سه ماه پیش دوره های ریکت و جاوااسکریپت سایت بوتواستارت رو شرکت کردم، پشتیبانی دوره واقعا عالی بود. از لحظه به لحظه دوره لذت بردم و الانم منجر به کار پیدا کردن من شد.'
        }
    ],
    allCommentsStudent : [
        {
            id: 1,
            posterVideo: 'https://botostart.org/comments/sara-rahimi.png',
            videoSrc: 'https://botostart.org/comments/sara-rahimi.mov',
            gender: 'Female',
            name: 'سارا رحیمی',
            studentCourses: 'دانشجوی HTNL&CSS و جاوا اسکریپت',
            text: 'من دوره HTML&CSS و جاوااسکریپت استاد عظمی رو تهیه کردم و به نظرم علاوه بر اینکه خیلی ساده و قابل فهم توضیح دادن، پشتیبانی خیلی خوب و قوی داره، ینی هر وقت که سوالی برامون پیش بیاد میتونیم بپرسیم و در کمترین زمان ممکن جواب رو میگیریم'
        },
        {
            id: 2,
            posterVideo: 'https://botostart.org/comments/kian-baban.png',
            videoSrc: 'https://botostart.org/comments/kian-baban.mov',
            gender: 'male',
            name: 'کیان بابا(ساکن کانادا)',
            studentCourses: 'دانشجوی جاوااسکریپت و ریکت',
            text: 'من در دوره های HTML&CSS و جاوااسکریپت و ریکت سایت بوتواستارت شرکت کردم و تونستم تو کمتر از چهار ماه بدون هیچ پیشینه‌ای در زمینه فرانت اند به تسلط خوبی برسم.'
        },
        {
            id: 3,
            posterVideo: 'https://botostart.org/comments/mehdi-ehsani.png',
            videoSrc: 'https://botostart.org/comments/mehdi-ehsani.mov',
            gender: 'male',
            name: 'مهدی احسانی',
            studentCourses: 'دانشجوی جاوااسکریپت و ریکت',
            text: 'این دوره قطعا یکی از بهترین دوره هایی بود که من تا الان دیده بودم و همه چی داخلش توضیح داده شده و یکی از امکانات خوبی که این دوره داره اینه که پشتیبانی آنلاین داره و میتونیم هر سوالی راجب هر مبحثی رو بپرسیم.'
        },
        {
            id: 4,
            posterVideo: 'https://botostart.org/comments/samira-farokhnezhad.png',
            videoSrc: 'https://botostart.org/comments/samira-farokhnezhad.mov',
            gender: 'Female',
            name: 'سمیرا فرخ نژاد(ساکن استالیا)',
            studentCourses: 'دانشجوی جاوااسکریپت و ریکت',
            text: 'من سه ماه پیش دوره های ریکت و جاوااسکریپت سایت بوتواستارت رو شرکت کردم، پشتیبانی دوره واقعا عالی بود. از لحظه به لحظه دوره لذت بردم و الانم منجر به کار پیدا کردن من شد.'
        },
        {
            id: 5,
            posterVideo: 'https://botostart.org/comments/kasra-akhavan.png',
            videoSrc: 'https://botostart.org/comments/kasra-akhavan.mov',
            gender: 'male',
            name: 'کسرا اخوان',
            studentCourses: 'دانشجوی ریکت و گیت',
            text: 'ریکت آقا میلاد حرف نداره، صفر تا صد کارو خیلی سلیس و روون توضیح داده. در مورد پشتیبانی هم اینکه هر وقت پیام بدین تو کوتاه ترین زمان ممکن جوابتون رو میده.'
        },
        {
            id: 6,
            posterVideo: 'https://botostart.org/comments/amir-khosroshahi.png',
            videoSrc: 'https://botostart.org/comments/amir-khosroshahi.mov',
            gender: 'male',
            name: 'امیر خسروشاهی',
            studentCourses: 'دانشجوی جاوااسکریپت و ریکت',
            text: 'من بعد از مشاهده دوره ها و پشت سر گذاشتن یه سری مصاحبه های فنی تونستم استخدام بشم. تموم نکاتی رو که دوره گفتی تو مصاحبه پرسیدن و تونستم به خوبی قبول بشم.'
        },
        {
            id: 7,
            posterVideo: 'https://botostart.org/comments/saghar-abazari.png',
            videoSrc: 'https://botostart.org/comments/saghar-abazari.mov',
            gender: 'female',
            name: 'ساغر ابازری(ساکن انگلیس)',
            studentCourses: 'دانشجوی HTML&CSS و جاوااسکریپت',
            text: 'سلام، من ۳۲ سالمه، ایران زندگی نمیکنم، من HTML&CSSرو از ماش همدانی یاد گرفتم اما ترجیح دادم جاوااسکریپت رو به زبان فارسی یاد بگیرم و بعد از کلی تحقیق تو دوره های آقا میلاد ثبت نام کردم و از نحوه تدریس و پشتیبانی خیلی راضیم.'
        },
                {
            id: 8,
            posterVideo: 'https://botostart.org/comments/sorena-ganji.png',
            videoSrc: 'https://botostart.org/comments/sorena-ganji.mov',
            gender: 'male',
            name: 'سورنا گنجی',
            studentCourses: 'دانشجوی جاوااسکریپت و ریکت',
            text: 'این دوره، اولین انتخاب من نبود ولی وقتی بقیه دوره هارو رصد کردم دیدم مثل این دوره تو دوره های فارسی اصلا نیست. مباحث خیلی کامل و جامع گفته شده و پشتیبانی خیلی خوبی داره.یکی از خوبی ها استاد اینه که مباحث پیچیده رو خیلی ساده توضیح میدن و تو مراحل مصاحبه هم همراهم بودن.'
        },
        {
            id: 9,
            posterVideo: 'https://botostart.org/comments/mamad-ataei.png',
            videoSrc: 'https://botostart.org/comments/mamad-ataei.mov',
            gender: 'male',
            name: 'محمد عطایی ',
            studentCourses: 'دانشجوی جاوااسکریپت و ریکت',
            text: 'من از دانشجو های آقای عظمی هستم، از قدرت بیانشون، تدریس رونشون و پشتیبانیشون خیلی راضی هستم.'
        },
        {
            id: 10,
            posterVideo: 'https://botostart.org/comments/abolfazl-akbarzadeh.png',
            videoSrc: 'https://botostart.org/comments/abolfazl-akbarzadeh.mov',
            gender: 'male',
            name: 'ابوالفضل اکبرزاده',
            studentCourses: 'دانشجوی HTML&CSS و جاوااسکریپت',
            text: 'من تو دوره های بوتواستارت شرکت کردم و این یکی از بهترین انتخاب هایی بود که من تو زمینه برنامه نویسی داشتم چون من تو دوره های دیگه هم شرکت کردم و توی تون دوره ها علاوه بر اینکه مباحث به صورت دقیق توضیح داده نمیشه، پشتیبانی خوبی هم نداشتند اما این دوره همه این نکات رو داره.'
        },
        {
            id: 11,
            posterVideo: 'https://botostart.org/comments/amir-amani.png',
            videoSrc: 'https://botostart.org/comments/amir-amani.mov',
            gender: 'male',
            name: 'امیر علی امانی پور',
            studentCourses: 'دانشجوی جاوااسکریپت',
            text: 'من دانشجوی دوره جاوااسکریپت آقای عظمی هستم، خواستم بگم که دوره شون خیلی خوب داره پیش میره و جدای از دوره خوبشون، پشتیبانیشون خیلی خوبه که در اسرع وقت به سوالات پاسخ کامل داده میشه.'
        },


    ],

    aboutUs : [
        {
            title: 'رسالت بوتواستارت',
            description: [
                {
                    title: '',
                    text: 'قبل از هر چیزی، یک دوره آموزشی باید با زبانی کاملا ساده و شیوا گفته شده باشد و به تمام و جزییات و نکاتی که ممکن است برای مخاطب سوال به وجود آورد بپردازد. این نکته در عین سادگی‌بسیار مهم است چرا که قدم های بعدی آموزش و یادگیری شما به درک مفاهیم پایه بستگی دارد و سعی کردیم که این کار را به بهترین نحو انجام دهیم.',
                },
            ]
        },
        {
            title: 'ویژگی های آموزش ما',
            description: [
                {
                    title: 'زبان ساده و روان',
                    text: 'امروزه انتخاب یک دوره آموزشی کار بسیار سختی است، چرا که بی نهایت دوره در اینترنت پیدا میشود که حتی به کوچکترین استاندارد های یک دوره آموزشی مناسب دقت نکرده اند. ما در بوتواستارت سعی میکنیم با رعایت این استاندارد ها و ارائه دوره‌ هایی با کیفیت و کامل مسیر پیشرفت شمارو هموار بکنیم، این دوره ها حاصل سال ها تجربه کار برنامه نویسی و آموزش آن است که به صورت یکجا درآمده تا در دسترس شما قرار گیرد و بتوانید بهترین نتیجه را از آن بگیرید.',
                },
                {
                    title: 'از صفر تا پیشرفته',
                    text: 'در قدم بعدی سعی کردیم مباحث را از صفر (به صورتی که نیاز به هیچ پیشنیازی نداشته باشید) تا پیشرفته پوشش دهیم تا فقط با شرکت در یک دوره به سطحی مناسب برای ورود به بازار کار برسید.',
                },
                {
                    title: 'پروژه محور',
                    text: 'بعد از یادگیری مفاهیم، چیزی که باعث درک و تسلط شما میشود انجام پروژه و تمرین است که در تمام دوره های بوتواستارت تعداد زیادی تمرین و پروژه های پیشرفته حل شده تا دید بسیار دقیقی از برنامه به شما داده شود.',
                },
                {
                    title: 'پشتیبانی دائمی',
                    text: 'هر کسی در ابتدای راه برنامه نویسی با یک سری سوالات و ابهامات رو به رو میشود، چه فنی و چه غیر فنی. این سوالات ممکن است روز ها و هفته ها از وقت شما را تلف کند اما با وجود یک برنامه نویس حرفه‌ای و پشتیبان در کنار شما خیلی زود این ابهامات کنار زده خواهد شد و پیشرفت سریع تری خواهید داشت، به همین دلیل دوره های‌ بوتواستارت پشتیبانی دائمی دارند تا در تمام مراحل یادگیری، استخدام و بعد از استخدام کنار شما باشیم.',
                },
                {
                    title: 'آپدیت',
                    text: 'برنامه نویسی علمی‌در حال پیشرفت است و ما سعی کرده این تا دوره ها را آپدیت نگه داریم به صورتی که آخرین ورژن هر تکنولوژی در داخل دوره ها پوشش داده شده است تا همیشه در لبه تکنولوژی بمانید.',
                },
                {
                    title: 'وبینار های هفتگی',
                    text: 'مسیر یادگیری پستی و بلندی های زیادی دارد، در این مسیر با هم هستیم و با برگزاری وبینار های هفتگی دور هم جمع میشویم و از مشکلات و چالش ها حرف میزنیم و برایشان راه حل پیدا میکنیم. تجربه ثابت کرده که وبینار های هفتگی تاثیر بسیار زیادی بر روی انگیزه و انرژی دانشجو ها برای ادامه یادگیری میگذارد.',
                },
            ]
        },
        {
            title: 'دوره ها تضمین استخدام دارند؟',   
            description: [
                {
                    title: '',
                    text: 'رسیدن به مرحله استخدام دو فاکتور بسیار مهم دارد: ۱-دوره آموزشی، ۲-تلاش شما در دوره های بوتواستارت هر چیزی که برای رسیدن به مرحله استخدام نیاز است در اختیار شما گذاشته شده است اما این شما هستید که باید از این محتوا استفاده کنید و تلاش شما است که باعث به نتیجه رسیدن دوره ها میشود. پس اگر شما قول بدهید که دوره هارا کامل ببینید و تمرین کنید ما هم این قول را میدهیم که به زودی به مرحله استخدام خواهید رسید.',
                },
            ]
        },
    ],


}

export {data}